{
  "items": [
    {
      "title": "The End of Early Stage Venture",
      "pubDate": "2024-04-15 14:02:22",
      "link": "https://chappyasel.medium.com/the-end-of-early-stage-venture-e61d68ab0d8c?source=rss-816a93f20fac------2",
      "guid": "https://medium.com/p/e61d68ab0d8c",
      "author": "Chappy Asel",
      "thumbnail": "https://cdn-images-1.medium.com/max/1024/1*wG5_l--1YlkdJDW3i8E9XA.jpeg",
      "description": "Early stage venture is doomed.\n\nIf your inner monologue just exclaimed “wow, that’s a bold claim” — you’re right! However, after talking with hundreds of fellow founders, operators, and investors during our weekly GenAI Collective community events, I have yet to hear a compelling counter to this claim in light of its supporting arguments.\n\nTo get a better sense of where I’m coming from, let me walk you through the seismic shifts I’m seeing playing out in Silicon Valley right now and what happens after the death of early stage venture as we know it.\nEarly Stage Venture 1.0\n\nSince the inception of software venture capital in the 1980s, investors have been taking the same fundamental gamble: invest in the 1% of companies with the potential to generate 100x+ returns by reaching a $100M+ run rate and $1B+ valuation, paving the way to an exit via initial public offering (IPO) or large scale M&A. Decades later, startups seeking venture funding face the same implicit requirement to tackle a $1"
    },
    {
      "title": "The Apple Way",
      "pubDate": "2023-11-12 16:53:47",
      "link": "https://chappyasel.medium.com/the-apple-way-013c1192be67?source=rss-816a93f20fac------2",
      "guid": "https://medium.com/p/013c1192be67",
      "author": "Chappy Asel",
      "thumbnail": "https://cdn-images-1.medium.com/max/1024/1*LQvCHcR90Z_HSY_M2_GbaQ.jpeg",
      "description": "Four lessons from working on the Apple Vision Pro team.\n\nThe Apple Vision Pro will define a new paradigm in computing. As an AR/VR engineer working on VisionOS for the past two years and experiencing firsthand the breathtaking magic that is the VisionOS spatial computing platform, I can say this with the utmost confidence.\n\nHow did we pull this off? What makes Apple so special? How has Apple secured its dominance as the most valuable company, most trusted and admired brand, and most notorious consumer product design house in the world? In my experience working on cross-functional projects with nearly every organization in Apple, there is a particular modus operandi — “the Apple way” — permeating the entire company. Below are four elements of this culture which I believe have been pivotal in elevating Apple to its zenith of innovation and value.\nProduct Ownership\n\nThe Vision Pro software team has no product managers. Instead, product is a collaborative task shared by the design, enginee"
    },
    {
      "title": "AGI Manifesto Part I: Promise",
      "pubDate": "2023-11-04 17:18:52",
      "link": "https://chappyasel.medium.com/agi-manifesto-promise-7fb056293f67?source=rss-816a93f20fac------2",
      "guid": "https://medium.com/p/7fb056293f67",
      "author": "Chappy Asel",
      "thumbnail": "https://cdn-images-1.medium.com/max/1024/1*HWxNy38DyAgyYldYDik89g.jpeg",
      "description": "What do Joe Biden, Elon Musk, Barack Obama, Vladimir Putin, Xi Jinping, Bill Gates, Warren Buffet, and Mark Zuckerberg all have in common? They are unanimously calling attention to the profound social, cultural, and even cosmic implications foreshadowed by the recent breakthroughs in artificial intelligence (AI). The line between creator and creation is blurring — challenging the very notion of what it means to be human. More existentially, many claim we are living on the precipice of life’s most significant evolution in its 3.7-billion-year history¹.\n\nAs anyone living in Cerebral Valley will tell you, AI is the new land of opportunity. While Google Research kicked off the gold rush in 2017, it was OpenAI that roused mass awareness when it released ChatGPT to the public last November². Announced merely four months later, its successor, GPT-4, surpasses human performance on a majority of standardized tests and is too powerful for full public release³.\n\nWith this bl"
    },
    {
      "title": "The GenAI Collective: A Shared Curiosity",
      "pubDate": "2023-04-12 14:10:30",
      "link": "https://chappyasel.medium.com/the-gai-collective-a-shared-curiosity-1640fac12ddd?source=rss-816a93f20fac------2",
      "guid": "https://medium.com/p/1640fac12ddd",
      "author": "Chappy Asel",
      "thumbnail": "https://cdn-images-1.medium.com/max/1024/0*sQmyOcdEwon5pzYy",
      "description": "Is AI conscious? Can public policy keep pace with the rapid developments in AI? How will generative AI transform the creator economy? How can startups working with generative AI develop competitive moats? How do we invest in and capitalize on the generative AI boom? These were just a few of the thought provoking questions discussed at the SF GAI Summit.\n\nWe are living in an exciting period of accelerating technical progress that is actively reshaping our economic and societal landscapes. We can all feel the tectonic plates shifting under our feet and are trying to predict the future’s tremors. This collective curiosity manifested at the summit as animated conversation between inquisitive minds swirled throughout the room, reminiscent of a modern Homebrew Club — fertile ground for the mushrooming of generative AI’s next great innovations, products, and companies.\nDiscovering Generative AI\n\nI distinctly remember the spark of awe and curiosity tha"
    },
    {
      "title": "America’s AI Ultimatum: Forge Ahead or Fall Behind",
      "pubDate": "2023-04-02 23:10:00",
      "link": "https://chappyasel.medium.com/americas-ai-ultimatum-5552e27eeece?source=rss-816a93f20fac------2",
      "guid": "https://medium.com/p/5552e27eeece",
      "author": "Chappy Asel",
      "thumbnail": "https://cdn-images-1.medium.com/max/1024/1*ruWnb_GaImoIiKnpjP_Ztw.png",
      "description": "This week, an open letter signed by over 2,000 AI luminaries called for an immediate six-month moratorium on training giant AI systems. We view the letter as a call to arms rather than a cease fire. As a matter of national interest, America must accelerate AI development to secure its lead in artificial intelligence and develop trustworthy AI systems.\n\nBy Paul Asel and Chappy Asel\nSource: Midjourney V5\nSometimes little happens in a decade. Sometimes a decade happens in a month.\n\nChatGPT has taken the world by storm heralding the prospects and perils of generative artificial intelligence to a mass audience for the first time. ChatGPT reached one million users in five days, fifteen times faster than any prior app, and now over 100 million have experienced the weird and wonderous musings of generative AI.\n\nThe frenetic pace of development accelerated this month as OpenAI upgraded ChatGPT with the release of GPT-4 and ChatGPT Plugins. Google announced Bard, their PaLM API, and integration "
    },
    {
      "title": "Can ChatGPT Generate a Full iOS App?",
      "pubDate": "2023-02-20 15:30:20",
      "link": "https://chappyasel.medium.com/can-chatgpt-generate-a-full-ios-app-c1969c92c709?source=rss-816a93f20fac------2",
      "guid": "https://medium.com/p/c1969c92c709",
      "author": "Chappy Asel",
      "thumbnail": "https://cdn-images-1.medium.com/max/1024/1*ZwWNunGj7AAcz_v1QutAOA.png",
      "description": "We already know that ChatGPT has the coding interview skills to land itself a job at a top tech firm. However, job interviews are a notoriously poor predictor of on-the-job performance. So, how would ChatGPT fare performing the day-to-day tasks of a tech worker? Is the software engineering profession under an imminent existential threat?\n\nAs a mobile app developer, I wanted to understand ChatGPT’s ability to design and program large-scale applications. Can it piece together an entire project and transform mobile app development into an interactive, “choose your own adventure” experience? Can ChatGPT democratize app development — placing this valuable skill in the hands of the average layperson with an original idea?\nSource: MidjourneyChatGPT Codes an App\n\nTo evaluate ChatGPT’s app development skills, I decided to guide it through the development of a fully featured “Reddit client” iOS app. RedditGPT should have the ability to load a list of posts from a user-specified subreddit along w"
    },
    {
      "title": "From Nerd to Bodybuilder: Embracing Paradoxical Passions",
      "pubDate": "2022-12-11 20:08:54",
      "link": "https://chappyasel.medium.com/from-nerd-to-bodybuilder-b9b13bb2d245?source=rss-816a93f20fac------2",
      "guid": "https://medium.com/p/b9b13bb2d245",
      "author": "Chappy Asel",
      "thumbnail": "https://cdn-images-1.medium.com/max/1024/1*XhdQTwdLKSFVXBWZF9y7FQ.png",
      "description": "How does a shy nerd boy from high school find himself flexing on stage in front of hundreds of spectators donning little more than a G-string?\n\nSpray tanned and shaved from head to toe, I strode in front of the blinding spotlights as my name bellowed out over the PA system. Preparing to perform my solo posing routine, I masked first time jitters with a composed facade after hearing judges could sense fear like sharks smell blood in the water. Performing at a bodybuilding competition almost naked in front of a mass of ogling strangers was the culmination of a five-year journey. Once terrified at the mere thought of presenting a powerpoint in front of a small class, it hit me: how did I get here?\n\nI have been enthralled by computers and programming for as long as I can remember. Spending entire weekends squirreled away in my room, I taught myself how to write iOS applications, tinkered with Arduinos and bread board circuits, built custom computers, and reverse engineered electronic toys."
    }
  ]
}
